PLANS = {
    "برنامه‌نویسی": {
        "main": "۱ ساعت پایتون + تمرین پروژه کوچک",
        "support": "۲۰ دقیقه مرور مفاهیم قبلی",
        "challenge": "حل یک تمرین سخت بدون کمک"
    },

    "کنکور": {
        "main": "۲ ساعت مطالعه مفهومی",
        "support": "مرور خلاصه‌های دیروز",
        "challenge": "۳۰ تست زمان‌دار"
    },

    "زبان انگلیسی": {
        "main": "۲۰ لغت جدید + یادگیری",
        "support": "۱۰ دقیقه listening",
        "challenge": "یک متن بخوان و خلاصه کن"
    },

    "تناسب اندام": {
        "main": "۳۰ دقیقه تمرین",
        "support": "۱۰ دقیقه کشش",
        "challenge": "تمرین بدون توقف"
    },

    "کسب درآمد": {
        "main": "یادگیری یک مهارت درآمدی",
        "support": "دیدن یک ویدیو آموزشی",
        "challenge": "نوشتن یک ایده واقعی"
    }
}
