PLANS = {
    "برنامه‌نویسی": {
        "main": "۱ ساعت پایتون + تمرین پروژه کوچک",
        "support": "۲۰ دقیقه مرور مفاهیم",
        "challenge": "حل یک تمرین سخت"
    },

    "کنکور": {
        "main": "۲ ساعت مطالعه",
        "support": "مرور خلاصه‌ها",
        "challenge": "۳۰ تست زمان‌دار"
    },

    "زبان انگلیسی": {
        "main": "۲۰ لغت جدید",
        "support": "Listening",
        "challenge": "خلاصه یک متن"
    },

    "تناسب اندام": {
        "main": "۳۰ دقیقه ورزش",
        "support": "کشش بدن",
        "challenge": "تمرین بدون توقف"
    },

    "کسب درآمد": {
        "main": "یادگیری مهارت درآمدی",
        "support": "دیدن آموزش",
        "challenge": "نوشتن ایده"
    }
}
