# plans.py

PLANS = {
    "برنامه‌نویسی": [
        "۱ ساعت پایتون تمرین کن و 3 تمرین حل کن",
        "یک پروژه کوچک (ماشین حساب یا ToDo) بساز",
        "مفاهیم لیست و حلقه‌ها را مرور کن"
    ],

    "کنکور": [
        "۲ ساعت مطالعه متمرکز + خلاصه‌نویسی",
        "۳۰ تست زمان‌دار بزن",
        "مرور اشتباهات دیروز"
    ],

    "زبان انگلیسی": [
        "۲۰ لغت جدید حفظ کن",
        "۱۰ دقیقه Listening تمرین کن",
        "یک متن کوتاه بخوان و ترجمه کن"
    ],

    "تناسب اندام": [
        "۳۰ دقیقه تمرین (شنا، درازنشست، اسکات)",
        "۱۰ دقیقه کشش بدن",
        "پیاده‌روی سبک"
    ],

    "کسب درآمد": [
        "یک ایده درآمدی جدید بررسی کن",
        "دیدن یک ویدیو آموزشی کسب درآمد",
        "یادداشت یک مهارت پول‌ساز"
    ]
}